content/note/20241017133850-aws_cloudwatch.md
---
title: "AWS CloudWatch"
author: ["Shahin Azad"]
draft: false
---

Here I collect all tips, tricks and facts I learn daily while working
with [AWS CloudWatch](https://aws.amazon.com/cloudwatch/).


## Biggest Cost Pool {#biggest-cost-pool}

To determine which log group is the biggest one over time create a
Graphed metric with the following query ([More Info](https://repost.aws/knowledge-center/cloudwatch-logs-bill-increase)):

```sql
SORT(REMOVE_EMPTY(SEARCH('{AWS/Logs,LogGroupName} MetricName="IncomingBytes"', 'Sum', 2592000)),SUM, DESC)
```
